# Parameter Filter Rule Factory Create Not Contains Rule Method

Source: https://www.revitapidocs.com/2026/64869b9b-b67c-ed4e-8c5c-b204c936190c.htm

---

| Parameter Filter Rule Factory Create Not Contains Rule Method |
| --- |

Creates a filter rule that determines whether strings from the document do not
 contain a certain string value.
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public static FilterRule CreateNotContainsRule(
	ElementId parameter,
	string value
)
```

```
Public Shared Function CreateNotContainsRule (
	parameter As ElementId,
	value As String
) As FilterRule
```

```
public:
static FilterRule^ CreateNotContainsRule(
	ElementId^ parameter,
	String^ value
)
```

```
static member CreateNotContainsRule :
        parameter : ElementId *
        value : string -> FilterRule
```

#### Parameters

parameter ElementId
:   A string\-typed parameter used to get values from the document for a given element.

value String
:   The user\-supplied string value for which values from the document will be searched.

#### Return Value

FilterRule
Created filter rule object. Exceptions

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non\-optional argument was null |

See Also

#### Reference

ParameterFilterRuleFactory Class Autodesk.Revit.DB Namespace